programming/typescript.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>typescript.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	  <a href="/diary/programming/thrift.org.html">Prev: thrift.org</a>
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/programming">Up: programming</a>
	  	
	</span>

	<span id="next">
	  
	  <a href="/diary/programming/version-control">Next: version-control</a>
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="install">install</h1>
<div class="sourceCode" id="cb1"><pre class="sourceCode bash"><code class="sourceCode bash"><span id="cb1-1"><a href="#cb1-1"></a><span class="ex">npm</span> install -g typescript</span></code></pre></div>
<h1 id="overview">Overview</h1>
<p>Typescript is a language extends javascript with static type, OOP, interface, etc. Typescript provides a compiler <code>tsc</code> can convert the <code>.ts</code> to plain javascript.</p>
<p>Some features upon javascript is similar to other languages like Go, Python:</p>
<ol class="incremental">
<li>type annotation: py3k type annotation for static type checking</li>
<li>interface: similar to go interface (duck typing, or structural subtyping)</li>
<li>class: classical OOP class abstract</li>
</ol>
<h1 id="basic-type">Basic Type</h1>
<h2 id="beyond-javascript">beyond Javascript</h2>
<dl class="incremental">
<dt>embedded string expression</dt>
<dd><code>`hello ${name}: ${age+1}`</code>
</dd>
<dt>array type</dt>
<dd><code>T[]</code> or <code>Array&lt;T&gt;</code>
</dd>
<dt>tuple</dt>
<dd><code>let x: [string, number]</code>
</dd>
<dt>enum</dt>
<dd><code>enum Color {Red=1, Green, Blue}</code>
</dd>
<dt>any</dt>
<dd>any type vs Object type (similar to py3k)
</dd>
<dt>void</dt>
<dd>like void in C
</dd>
<dt>nerver</dt>
<dd>never return (throws exception always or block forever)
</dd>
</dl>
<h2 id="type-assertion">type assertion</h2>
<p>Programmer can specific precise type constrain and tell the compiler: "trust me, I know what I'm doing".</p>
<p>Simliar to type assertion in Go. No runtime impact, just static check and cast.</p>
<div class="sourceCode" id="cb2"><pre class="sourceCode typescript"><code class="sourceCode typescript"><span id="cb2-1"><a href="#cb2-1"></a>(<span class="op">&lt;</span><span class="dt">string</span><span class="op">&gt;</span>someValue).<span class="at">length</span></span>
<span id="cb2-2"><a href="#cb2-2"></a>(someValue <span class="im">as</span> string).<span class="at">length</span></span></code></pre></div>
<h2 id="advanced-topics">advanced topics</h2>
<h3 id="union-type"><span class="todo TODO">TODO</span> union type</h3>
<h3 id="any-vs-object"><span class="todo TODO">TODO</span> any vs object</h3>
<h1 id="variable-declarations"><span class="todo TODO">TODO</span> Variable Declarations</h1>
<h1 id="interface"><span class="todo TODO">TODO</span> Interface</h1>
<h1 id="oop">OOP</h1>
<h2 id="vs-javascript-prototype-based-oo">vs Javascript Prototype-based OO</h2>
<h1 id="functions">functions</h1>
<h2 id="optional-default-parameters">optional &amp; default parameters</h2>
<p><a href="https://www.typescriptlang.org/docs/handbook/functions.html#optional-and-default-parameters">https://www.typescriptlang.org/docs/handbook/functions.html#optional-and-default-parameters</a></p>
<p>显式声明可选参数</p>
<div class="sourceCode" id="cb3"><pre class="sourceCode ts"><code class="sourceCode typescript"><span id="cb3-1"><a href="#cb3-1"></a><span class="kw">function</span> <span class="fu">buildName</span>(firstName<span class="op">:</span> <span class="dt">string</span><span class="op">,</span> lastName<span class="op">?:</span> <span class="dt">string</span>) <span class="op">{</span></span>
<span id="cb3-2"><a href="#cb3-2"></a>    <span class="fu">if</span> (lastName)</span>
<span id="cb3-3"><a href="#cb3-3"></a>        <span class="cf">return</span> firstName <span class="op">+</span> <span class="st">&quot; &quot;</span> <span class="op">+</span> lastName<span class="op">;</span></span>
<span id="cb3-4"><a href="#cb3-4"></a>    <span class="cf">else</span></span>
<span id="cb3-5"><a href="#cb3-5"></a>        <span class="cf">return</span> firstName<span class="op">;</span></span>
<span id="cb3-6"><a href="#cb3-6"></a><span class="op">}</span></span>
<span id="cb3-7"><a href="#cb3-7"></a></span>
<span id="cb3-8"><a href="#cb3-8"></a><span class="kw">let</span> result1 <span class="op">=</span> <span class="fu">buildName</span>(<span class="st">&quot;Bob&quot;</span>)<span class="op">;</span>                  <span class="co">// works correctly now</span></span>
<span id="cb3-9"><a href="#cb3-9"></a><span class="kw">let</span> result2 <span class="op">=</span> <span class="fu">buildName</span>(<span class="st">&quot;Bob&quot;</span><span class="op">,</span> <span class="st">&quot;Adams&quot;</span><span class="op">,</span> <span class="st">&quot;Sr.&quot;</span>)<span class="op">;</span>  <span class="co">// error, too many parameters</span></span>
<span id="cb3-10"><a href="#cb3-10"></a><span class="kw">let</span> result3 <span class="op">=</span> <span class="fu">buildName</span>(<span class="st">&quot;Bob&quot;</span><span class="op">,</span> <span class="st">&quot;Adams&quot;</span>)<span class="op">;</span>         <span class="co">// ah, just right</span></span></code></pre></div>
<div class="sourceCode" id="cb4"><pre class="sourceCode ts"><code class="sourceCode typescript"><span id="cb4-1"><a href="#cb4-1"></a><span class="kw">function</span> <span class="fu">buildName</span>(firstName<span class="op">:</span> <span class="dt">string</span><span class="op">,</span> lastName <span class="op">=</span> <span class="st">&quot;Smith&quot;</span>) <span class="op">{</span></span>
<span id="cb4-2"><a href="#cb4-2"></a>    <span class="cf">return</span> firstName <span class="op">+</span> <span class="st">&quot; &quot;</span> <span class="op">+</span> lastName<span class="op">;</span></span>
<span id="cb4-3"><a href="#cb4-3"></a><span class="op">}</span></span>
<span id="cb4-4"><a href="#cb4-4"></a></span>
<span id="cb4-5"><a href="#cb4-5"></a><span class="kw">let</span> result1 <span class="op">=</span> <span class="fu">buildName</span>(<span class="st">&quot;Bob&quot;</span>)<span class="op">;</span>                  <span class="co">// works correctly now, returns &quot;Bob Smith&quot;</span></span>
<span id="cb4-6"><a href="#cb4-6"></a><span class="kw">let</span> result2 <span class="op">=</span> <span class="fu">buildName</span>(<span class="st">&quot;Bob&quot;</span><span class="op">,</span> <span class="kw">undefined</span>)<span class="op">;</span>       <span class="co">// still works, also returns &quot;Bob Smith&quot;</span></span>
<span id="cb4-7"><a href="#cb4-7"></a><span class="kw">let</span> result3 <span class="op">=</span> <span class="fu">buildName</span>(<span class="st">&quot;Bob&quot;</span><span class="op">,</span> <span class="st">&quot;Adams&quot;</span><span class="op">,</span> <span class="st">&quot;Sr.&quot;</span>)<span class="op">;</span>  <span class="co">// error, too many parameters</span></span>
<span id="cb4-8"><a href="#cb4-8"></a><span class="kw">let</span> result4 <span class="op">=</span> <span class="fu">buildName</span>(<span class="st">&quot;Bob&quot;</span><span class="op">,</span> <span class="st">&quot;Adams&quot;</span>)<span class="op">;</span>         <span class="co">// ah, just right</span></span></code></pre></div>

      </div>
    </section>
  </body>
</html>
